k6/results/rest/01-state-relay-latency.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: k6/01-state-relay-latency.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 4m30s max duration (incl. graceful stop):
              * relay_latency: Up to 20 looping VUs for 4m0s over 5 stages (gracefulRampDown: 30s, gracefulStop: 30s)

time="2026-06-11T00:51:52+02:00" level=info msg="Health check passed. 8 apps registered." source=console

running (0m01.0s), 01/20 VUs, 0 complete and 0 interrupted iterations
relay_latency   [   0% ] 01/20 VUs  0m00.8s/4m00.0s

running (0m02.0s), 01/20 VUs, 0 complete and 0 interrupted iterations
relay_latency   [   1% ] 01/20 VUs  0m01.8s/4m00.0s

running (0m03.0s), 01/20 VUs, 0 complete and 0 interrupted iterations
relay_latency   [   1% ] 01/20 VUs  0m02.8s/4m00.0s

running (0m04.0s), 01/20 VUs, 0 complete and 0 interrupted iterations
relay_latency   [   2% ] 01/20 VUs  0m03.8s/4m00.0s

running (0m05.0s), 01/20 VUs, 0 complete and 0 interrupted iterations
relay_latency   [   2% ] 01/20 VUs  0m04.8s/4m00.0s

running (0m06.0s), 01/20 VUs, 1 complete and 0 interrupted iterations
relay_latency   [   2% ] 01/20 VUs  0m05.8s/4m00.0s

running (0m07.0s), 01/20 VUs, 1 complete and 0 interrupted iterations
relay_latency   [   3% ] 01/20 VUs  0m06.8s/4m00.0s

running (0m08.0s), 02/20 VUs, 1 complete and 0 interrupted iterations
relay_latency   [   3% ] 02/20 VUs  0m07.8s/4m00.0s

running (0m09.0s), 02/20 VUs, 1 complete and 0 interrupted iterations
relay_latency   [   4% ] 02/20 VUs  0m08.8s/4m00.0s

running (0m10.0s), 02/20 VUs, 2 complete and 0 interrupted iterations
relay_latency   [   4% ] 02/20 VUs  0m09.8s/4m00.0s

running (0m11.0s), 02/20 VUs, 2 complete and 0 interrupted iterations
relay_latency   [   4% ] 02/20 VUs  0m10.8s/4m00.0s

running (0m12.0s), 02/20 VUs, 2 complete and 0 interrupted iterations
relay_latency   [   5% ] 02/20 VUs  0m11.8s/4m00.0s

running (0m13.0s), 02/20 VUs, 3 complete and 0 interrupted iterations
relay_latency   [   5% ] 02/20 VUs  0m12.8s/4m00.0s

running (0m14.0s), 02/20 VUs, 3 complete and 0 interrupted iterations
relay_latency   [   6% ] 02/20 VUs  0m13.8s/4m00.0s

running (0m15.0s), 02/20 VUs, 4 complete and 0 interrupted iterations
relay_latency   [   6% ] 02/20 VUs  0m14.8s/4m00.0s

running (0m16.0s), 03/20 VUs, 4 complete and 0 interrupted iterations
relay_latency   [   7% ] 03/20 VUs  0m15.8s/4m00.0s

running (0m17.0s), 03/20 VUs, 4 complete and 0 interrupted iterations
relay_latency   [   7% ] 03/20 VUs  0m16.8s/4m00.0s

running (0m18.0s), 03/20 VUs, 5 complete and 0 interrupted iterations
relay_latency   [   7% ] 03/20 VUs  0m17.8s/4m00.0s

running (0m19.0s), 03/20 VUs, 5 complete and 0 interrupted iterations
relay_latency   [   8% ] 03/20 VUs  0m18.8s/4m00.0s

running (0m20.0s), 03/20 VUs, 6 complete and 0 interrupted iterations
relay_latency   [   8% ] 03/20 VUs  0m19.8s/4m00.0s

running (0m21.0s), 03/20 VUs, 7 complete and 0 interrupted iterations
relay_latency   [   9% ] 03/20 VUs  0m20.8s/4m00.0s

running (0m22.0s), 03/20 VUs, 7 complete and 0 interrupted iterations
relay_latency   [   9% ] 03/20 VUs  0m21.8s/4m00.0s

running (0m23.0s), 04/20 VUs, 8 complete and 0 interrupted iterations
relay_latency   [   9% ] 04/20 VUs  0m22.8s/4m00.0s

running (0m24.0s), 04/20 VUs, 8 complete and 0 interrupted iterations
relay_latency   [  10% ] 04/20 VUs  0m23.8s/4m00.0s

running (0m25.0s), 04/20 VUs, 9 complete and 0 interrupted iterations
relay_latency   [  10% ] 04/20 VUs  0m24.8s/4m00.0s

running (0m26.0s), 04/20 VUs, 10 complete and 0 interrupted iterations
relay_latency   [  11% ] 04/20 VUs  0m25.8s/4m00.0s

running (0m27.0s), 04/20 VUs, 10 complete and 0 interrupted iterations
relay_latency   [  11% ] 04/20 VUs  0m26.8s/4m00.0s

running (0m28.0s), 04/20 VUs, 12 complete and 0 interrupted iterations
relay_latency   [  12% ] 04/20 VUs  0m27.8s/4m00.0s

running (0m29.0s), 04/20 VUs, 12 complete and 0 interrupted iterations
relay_latency   [  12% ] 04/20 VUs  0m28.8s/4m00.0s

running (0m30.0s), 04/20 VUs, 13 complete and 0 interrupted iterations
relay_latency   [  12% ] 04/20 VUs  0m29.8s/4m00.0s

running (0m31.0s), 05/20 VUs, 14 complete and 0 interrupted iterations
relay_latency   [  13% ] 05/20 VUs  0m30.8s/4m00.0s

running (0m32.0s), 05/20 VUs, 14 complete and 0 interrupted iterations
relay_latency   [  13% ] 05/20 VUs  0m31.8s/4m00.0s

running (0m33.0s), 05/20 VUs, 16 complete and 0 interrupted iterations
relay_latency   [  14% ] 05/20 VUs  0m32.8s/4m00.0s

running (0m34.0s), 05/20 VUs, 16 complete and 0 interrupted iterations
relay_latency   [  14% ] 05/20 VUs  0m33.8s/4m00.0s

running (0m35.0s), 05/20 VUs, 18 complete and 0 interrupted iterations
relay_latency   [  14% ] 05/20 VUs  0m34.8s/4m00.0s

running (0m36.0s), 05/20 VUs, 19 complete and 0 interrupted iterations
relay_latency   [  15% ] 05/20 VUs  0m35.8s/4m00.0s

running (0m37.0s), 05/20 VUs, 20 complete and 0 interrupted iterations
relay_latency   [  15% ] 05/20 VUs  0m36.8s/4m00.0s

running (0m38.0s), 05/20 VUs, 21 complete and 0 interrupted iterations
relay_latency   [  16% ] 05/20 VUs  0m37.8s/4m00.0s

running (0m39.0s), 05/20 VUs, 21 complete and 0 interrupted iterations
relay_latency   [  16% ] 05/20 VUs  0m38.8s/4m00.0s

running (0m40.0s), 05/20 VUs, 24 complete and 0 interrupted iterations
relay_latency   [  17% ] 05/20 VUs  0m39.8s/4m00.0s

running (0m41.0s), 05/20 VUs, 24 complete and 0 interrupted iterations
relay_latency   [  17% ] 05/20 VUs  0m40.8s/4m00.0s

running (0m42.0s), 05/20 VUs, 25 complete and 0 interrupted iterations
relay_latency   [  17% ] 05/20 VUs  0m41.8s/4m00.0s

running (0m43.0s), 06/20 VUs, 26 complete and 0 interrupted iterations
relay_latency   [  18% ] 06/20 VUs  0m42.8s/4m00.0s

running (0m44.0s), 06/20 VUs, 26 complete and 0 interrupted iterations
relay_latency   [  18% ] 06/20 VUs  0m43.8s/4m00.0s

running (0m45.0s), 06/20 VUs, 29 complete and 0 interrupted iterations
relay_latency   [  19% ] 06/20 VUs  0m44.8s/4m00.0s

running (0m46.0s), 06/20 VUs, 29 complete and 0 interrupted iterations
relay_latency   [  19% ] 06/20 VUs  0m45.8s/4m00.0s

running (0m47.0s), 06/20 VUs, 30 complete and 0 interrupted iterations
relay_latency   [  19% ] 06/20 VUs  0m46.8s/4m00.0s

running (0m48.0s), 06/20 VUs, 32 complete and 0 interrupted iterations
relay_latency   [  20% ] 06/20 VUs  0m47.8s/4m00.0s

running (0m49.0s), 06/20 VUs, 33 complete and 0 interrupted iterations
relay_latency   [  20% ] 06/20 VUs  0m48.8s/4m00.0s

running (0m50.0s), 06/20 VUs, 35 complete and 0 interrupted iterations
relay_latency   [  21% ] 06/20 VUs  0m49.8s/4m00.0s

running (0m51.0s), 06/20 VUs, 35 complete and 0 interrupted iterations
relay_latency   [  21% ] 06/20 VUs  0m50.8s/4m00.0s

running (0m52.0s), 06/20 VUs, 36 complete and 0 interrupted iterations
relay_latency   [  22% ] 06/20 VUs  0m51.8s/4m00.0s

running (0m53.0s), 06/20 VUs, 38 complete and 0 interrupted iterations
relay_latency   [  22% ] 06/20 VUs  0m52.8s/4m00.0s

running (0m54.0s), 06/20 VUs, 39 complete and 0 interrupted iterations
relay_latency   [  22% ] 06/20 VUs  0m53.8s/4m00.0s

running (0m55.0s), 07/20 VUs, 41 complete and 0 interrupted iterations
relay_latency   [  23% ] 07/20 VUs  0m54.8s/4m00.0s

running (0m56.0s), 07/20 VUs, 41 complete and 0 interrupted iterations
relay_latency   [  23% ] 07/20 VUs  0m55.8s/4m00.0s

running (0m57.0s), 07/20 VUs, 42 complete and 0 interrupted iterations
relay_latency   [  24% ] 07/20 VUs  0m56.8s/4m00.0s

running (0m58.0s), 07/20 VUs, 44 complete and 0 interrupted iterations
relay_latency   [  24% ] 07/20 VUs  0m57.8s/4m00.0s

running (0m59.0s), 07/20 VUs, 45 complete and 0 interrupted iterations
relay_latency   [  24% ] 07/20 VUs  0m58.8s/4m00.0s

running (1m00.0s), 07/20 VUs, 48 complete and 0 interrupted iterations
relay_latency   [  25% ] 07/20 VUs  0m59.8s/4m00.0s

running (1m01.0s), 07/20 VUs, 48 complete and 0 interrupted iterations
relay_latency   [  25% ] 07/20 VUs  1m00.8s/4m00.0s

running (1m02.0s), 07/20 VUs, 49 complete and 0 interrupted iterations
relay_latency   [  26% ] 07/20 VUs  1m01.8s/4m00.0s

running (1m03.0s), 07/20 VUs, 51 complete and 0 interrupted iterations
relay_latency   [  26% ] 07/20 VUs  1m02.8s/4m00.0s

running (1m04.0s), 07/20 VUs, 52 complete and 0 interrupted iterations
relay_latency   [  27% ] 07/20 VUs  1m03.8s/4m00.0s

running (1m05.0s), 07/20 VUs, 55 complete and 0 interrupted iterations
relay_latency   [  27% ] 07/20 VUs  1m04.8s/4m00.0s

running (1m06.0s), 07/20 VUs, 55 complete and 0 interrupted iterations
relay_latency   [  27% ] 07/20 VUs  1m05.8s/4m00.0s

running (1m07.0s), 08/20 VUs, 56 complete and 0 interrupted iterations
relay_latency   [  28% ] 08/20 VUs  1m06.8s/4m00.0s

running (1m08.0s), 08/20 VUs, 58 complete and 0 interrupted iterations
relay_latency   [  28% ] 08/20 VUs  1m07.8s/4m00.0s

running (1m09.0s), 08/20 VUs, 60 complete and 0 interrupted iterations
relay_latency   [  29% ] 08/20 VUs  1m08.8s/4m00.0s

running (1m10.0s), 08/20 VUs, 62 complete and 0 interrupted iterations
relay_latency   [  29% ] 08/20 VUs  1m09.8s/4m00.0s

running (1m11.0s), 08/20 VUs, 62 complete and 0 interrupted iterations
relay_latency   [  29% ] 08/20 VUs  1m10.8s/4m00.0s

running (1m12.0s), 08/20 VUs, 65 complete and 0 interrupted iterations
relay_latency   [  30% ] 08/20 VUs  1m11.8s/4m00.0s

running (1m13.0s), 08/20 VUs, 66 complete and 0 interrupted iterations
relay_latency   [  30% ] 08/20 VUs  1m12.8s/4m00.0s

running (1m14.0s), 08/20 VUs, 69 complete and 0 interrupted iterations
relay_latency   [  31% ] 08/20 VUs  1m13.8s/4m00.0s

running (1m15.0s), 08/20 VUs, 70 complete and 0 interrupted iterations
relay_latency   [  31% ] 08/20 VUs  1m14.8s/4m00.0s

running (1m16.0s), 08/20 VUs, 71 complete and 0 interrupted iterations
relay_latency   [  32% ] 08/20 VUs  1m15.8s/4m00.0s

running (1m17.0s), 08/20 VUs, 74 complete and 0 interrupted iterations
relay_latency   [  32% ] 08/20 VUs  1m16.8s/4m00.0s

running (1m18.0s), 08/20 VUs, 74 complete and 0 interrupted iterations
relay_latency   [  32% ] 08/20 VUs  1m17.8s/4m00.0s

running (1m19.0s), 09/20 VUs, 78 complete and 0 interrupted iterations
relay_latency   [  33% ] 09/20 VUs  1m18.8s/4m00.0s

running (1m20.0s), 09/20 VUs, 78 complete and 0 interrupted iterations
relay_latency   [  33% ] 09/20 VUs  1m19.8s/4m00.0s

running (1m21.0s), 09/20 VUs, 80 complete and 0 interrupted iterations
relay_latency   [  34% ] 09/20 VUs  1m20.8s/4m00.0s

running (1m22.0s), 09/20 VUs, 82 complete and 0 interrupted iterations
relay_latency   [  34% ] 09/20 VUs  1m21.8s/4m00.0s

running (1m23.0s), 09/20 VUs, 82 complete and 0 interrupted iterations
relay_latency   [  34% ] 09/20 VUs  1m22.8s/4m00.0s

running (1m24.0s), 09/20 VUs, 87 complete and 0 interrupted iterations
relay_latency   [  35% ] 09/20 VUs  1m23.8s/4m00.0s

running (1m25.0s), 09/20 VUs, 87 complete and 0 interrupted iterations
relay_latency   [  35% ] 09/20 VUs  1m24.8s/4m00.0s

running (1m26.0s), 09/20 VUs, 89 complete and 0 interrupted iterations
relay_latency   [  36% ] 09/20 VUs  1m25.8s/4m00.0s

running (1m27.0s), 09/20 VUs, 91 complete and 0 interrupted iterations
relay_latency   [  36% ] 09/20 VUs  1m26.8s/4m00.0s

running (1m28.0s), 09/20 VUs, 92 complete and 0 interrupted iterations
relay_latency   [  37% ] 09/20 VUs  1m27.8s/4m00.0s

running (1m29.0s), 09/20 VUs, 96 complete and 0 interrupted iterations
relay_latency   [  37% ] 09/20 VUs  1m28.8s/4m00.0s

running (1m30.0s), 09/20 VUs, 96 complete and 0 interrupted iterations
relay_latency   [  37% ] 09/20 VUs  1m29.8s/4m00.0s

running (1m31.0s), 10/20 VUs, 98 complete and 0 interrupted iterations
relay_latency   [  38% ] 10/20 VUs  1m30.8s/4m00.0s

running (1m32.0s), 10/20 VUs, 100 complete and 0 interrupted iterations
relay_latency   [  38% ] 10/20 VUs  1m31.8s/4m00.0s

running (1m33.0s), 10/20 VUs, 101 complete and 0 interrupted iterations
relay_latency   [  39% ] 10/20 VUs  1m32.8s/4m00.0s

running (1m34.0s), 10/20 VUs, 105 complete and 0 interrupted iterations
relay_latency   [  39% ] 10/20 VUs  1m33.8s/4m00.0s

running (1m35.0s), 10/20 VUs, 105 complete and 0 interrupted iterations
relay_latency   [  39% ] 10/20 VUs  1m34.8s/4m00.0s

running (1m36.0s), 10/20 VUs, 108 complete and 0 interrupted iterations
relay_latency   [  40% ] 10/20 VUs  1m35.8s/4m00.0s

running (1m37.0s), 11/20 VUs, 110 complete and 0 interrupted iterations
relay_latency   [  40% ] 11/20 VUs  1m36.8s/4m00.0s

running (1m38.0s), 11/20 VUs, 112 complete and 0 interrupted iterations
relay_latency   [  41% ] 11/20 VUs  1m37.8s/4m00.0s

running (1m39.0s), 11/20 VUs, 115 complete and 0 interrupted iterations
relay_latency   [  41% ] 11/20 VUs  1m38.8s/4m00.0s

running (1m40.0s), 11/20 VUs, 116 complete and 0 interrupted iterations
relay_latency   [  42% ] 11/20 VUs  1m39.8s/4m00.0s

running (1m41.0s), 11/20 VUs, 118 complete and 0 interrupted iterations
relay_latency   [  42% ] 11/20 VUs  1m40.8s/4m00.0s

running (1m42.0s), 11/20 VUs, 121 complete and 0 interrupted iterations
relay_latency   [  42% ] 11/20 VUs  1m41.8s/4m00.0s

running (1m43.0s), 12/20 VUs, 122 complete and 0 interrupted iterations
relay_latency   [  43% ] 12/20 VUs  1m42.8s/4m00.0s

running (1m44.0s), 12/20 VUs, 125 complete and 0 interrupted iterations
relay_latency   [  43% ] 12/20 VUs  1m43.8s/4m00.0s

running (1m45.0s), 12/20 VUs, 126 complete and 0 interrupted iterations
relay_latency   [  44% ] 12/20 VUs  1m44.8s/4m00.0s

running (1m46.0s), 12/20 VUs, 129 complete and 0 interrupted iterations
relay_latency   [  44% ] 12/20 VUs  1m45.8s/4m00.0s

running (1m47.0s), 12/20 VUs, 132 complete and 0 interrupted iterations
relay_latency   [  44% ] 12/20 VUs  1m46.8s/4m00.0s

running (1m48.0s), 12/20 VUs, 135 complete and 0 interrupted iterations
relay_latency   [  45% ] 12/20 VUs  1m47.8s/4m00.0s

running (1m49.0s), 13/20 VUs, 137 complete and 0 interrupted iterations
relay_latency   [  45% ] 13/20 VUs  1m48.8s/4m00.0s

running (1m50.0s), 13/20 VUs, 138 complete and 0 interrupted iterations
relay_latency   [  46% ] 13/20 VUs  1m49.8s/4m00.0s

running (1m51.0s), 13/20 VUs, 141 complete and 0 interrupted iterations
relay_latency   [  46% ] 13/20 VUs  1m50.8s/4m00.0s

running (1m52.0s), 13/20 VUs, 144 complete and 0 interrupted iterations
relay_latency   [  47% ] 13/20 VUs  1m51.8s/4m00.0s

running (1m53.0s), 13/20 VUs, 147 complete and 0 interrupted iterations
relay_latency   [  47% ] 13/20 VUs  1m52.8s/4m00.0s

running (1m54.0s), 13/20 VUs, 151 complete and 0 interrupted iterations
relay_latency   [  47% ] 13/20 VUs  1m53.8s/4m00.0s

running (1m55.0s), 14/20 VUs, 151 complete and 0 interrupted iterations
relay_latency   [  48% ] 14/20 VUs  1m54.8s/4m00.0s

running (1m56.0s), 14/20 VUs, 154 complete and 0 interrupted iterations
relay_latency   [  48% ] 14/20 VUs  1m55.8s/4m00.0s

running (1m57.0s), 14/20 VUs, 157 complete and 0 interrupted iterations
relay_latency   [  49% ] 14/20 VUs  1m56.8s/4m00.0s

running (1m58.0s), 14/20 VUs, 160 complete and 0 interrupted iterations
relay_latency   [  49% ] 14/20 VUs  1m57.8s/4m00.0s

running (1m59.0s), 14/20 VUs, 164 complete and 0 interrupted iterations
relay_latency   [  49% ] 14/20 VUs  1m58.8s/4m00.0s

running (2m00.0s), 14/20 VUs, 165 complete and 0 interrupted iterations
relay_latency   [  50% ] 14/20 VUs  1m59.8s/4m00.0s

running (2m01.0s), 15/20 VUs, 168 complete and 0 interrupted iterations
relay_latency   [  50% ] 15/20 VUs  2m00.8s/4m00.0s

running (2m02.0s), 15/20 VUs, 170 complete and 0 interrupted iterations
relay_latency   [  51% ] 15/20 VUs  2m01.8s/4m00.0s

running (2m03.0s), 15/20 VUs, 175 complete and 0 interrupted iterations
relay_latency   [  51% ] 15/20 VUs  2m02.8s/4m00.0s

running (2m04.0s), 15/20 VUs, 178 complete and 0 interrupted iterations
relay_latency   [  52% ] 15/20 VUs  2m03.8s/4m00.0s

running (2m05.0s), 15/20 VUs, 179 complete and 0 interrupted iterations
relay_latency   [  52% ] 15/20 VUs  2m04.8s/4m00.0s

running (2m06.0s), 15/20 VUs, 183 complete and 0 interrupted iterations
relay_latency   [  52% ] 15/20 VUs  2m05.8s/4m00.0s

running (2m07.0s), 16/20 VUs, 185 complete and 0 interrupted iterations
relay_latency   [  53% ] 16/20 VUs  2m06.8s/4m00.0s

running (2m08.0s), 16/20 VUs, 188 complete and 0 interrupted iterations
relay_latency   [  53% ] 16/20 VUs  2m07.8s/4m00.0s

running (2m09.0s), 16/20 VUs, 193 complete and 0 interrupted iterations
relay_latency   [  54% ] 16/20 VUs  2m08.8s/4m00.0s

running (2m10.0s), 16/20 VUs, 194 complete and 0 interrupted iterations
relay_latency   [  54% ] 16/20 VUs  2m09.8s/4m00.0s

running (2m11.0s), 16/20 VUs, 195 complete and 0 interrupted iterations
relay_latency   [  54% ] 16/20 VUs  2m10.8s/4m00.0s

running (2m12.0s), 16/20 VUs, 201 complete and 0 interrupted iterations
relay_latency   [  55% ] 16/20 VUs  2m11.8s/4m00.0s

running (2m13.0s), 17/20 VUs, 203 complete and 0 interrupted iterations
relay_latency   [  55% ] 17/20 VUs  2m12.8s/4m00.0s

running (2m14.0s), 17/20 VUs, 207 complete and 0 interrupted iterations
relay_latency   [  56% ] 17/20 VUs  2m13.8s/4m00.0s

running (2m15.0s), 17/20 VUs, 210 complete and 0 interrupted iterations
relay_latency   [  56% ] 17/20 VUs  2m14.8s/4m00.0s

running (2m16.0s), 17/20 VUs, 210 complete and 0 interrupted iterations
relay_latency   [  57% ] 17/20 VUs  2m15.8s/4m00.0s

running (2m17.0s), 17/20 VUs, 211 complete and 0 interrupted iterations
relay_latency   [  57% ] 17/20 VUs  2m16.8s/4m00.0s

running (2m18.0s), 17/20 VUs, 215 complete and 0 interrupted iterations
relay_latency   [  57% ] 17/20 VUs  2m17.8s/4m00.0s

running (2m19.0s), 18/20 VUs, 220 complete and 0 interrupted iterations
relay_latency   [  58% ] 18/20 VUs  2m18.8s/4m00.0s

running (2m20.0s), 18/20 VUs, 225 complete and 0 interrupted iterations
relay_latency   [  58% ] 18/20 VUs  2m19.8s/4m00.0s

running (2m21.0s), 18/20 VUs, 227 complete and 0 interrupted iterations
relay_latency   [  59% ] 18/20 VUs  2m20.8s/4m00.0s

running (2m22.0s), 18/20 VUs, 227 complete and 0 interrupted iterations
relay_latency   [  59% ] 18/20 VUs  2m21.8s/4m00.0s

running (2m23.0s), 18/20 VUs, 229 complete and 0 interrupted iterations
relay_latency   [  59% ] 18/20 VUs  2m22.8s/4m00.0s

running (2m24.0s), 18/20 VUs, 230 complete and 0 interrupted iterations
relay_latency   [  60% ] 18/20 VUs  2m23.8s/4m00.0s

running (2m25.0s), 19/20 VUs, 237 complete and 0 interrupted iterations
relay_latency   [  60% ] 19/20 VUs  2m24.8s/4m00.0s

running (2m26.0s), 19/20 VUs, 241 complete and 0 interrupted iterations
relay_latency   [  61% ] 19/20 VUs  2m25.8s/4m00.0s

running (2m27.0s), 19/20 VUs, 245 complete and 0 interrupted iterations
relay_latency   [  61% ] 19/20 VUs  2m26.8s/4m00.0s

running (2m28.0s), 19/20 VUs, 246 complete and 0 interrupted iterations
relay_latency   [  62% ] 19/20 VUs  2m27.8s/4m00.0s

running (2m29.0s), 19/20 VUs, 248 complete and 0 interrupted iterations
relay_latency   [  62% ] 19/20 VUs  2m28.8s/4m00.0s

running (2m30.0s), 19/20 VUs, 249 complete and 0 interrupted iterations
relay_latency   [  62% ] 19/20 VUs  2m29.8s/4m00.0s

running (2m31.0s), 20/20 VUs, 253 complete and 0 interrupted iterations
relay_latency   [  63% ] 20/20 VUs  2m30.8s/4m00.0s

running (2m32.0s), 20/20 VUs, 261 complete and 0 interrupted iterations
relay_latency   [  63% ] 20/20 VUs  2m31.8s/4m00.0s

running (2m33.0s), 20/20 VUs, 263 complete and 0 interrupted iterations
relay_latency   [  64% ] 20/20 VUs  2m32.8s/4m00.0s

running (2m34.0s), 20/20 VUs, 264 complete and 0 interrupted iterations
relay_latency   [  64% ] 20/20 VUs  2m33.8s/4m00.0s

running (2m35.0s), 20/20 VUs, 266 complete and 0 interrupted iterations
relay_latency   [  64% ] 20/20 VUs  2m34.8s/4m00.0s

running (2m36.0s), 20/20 VUs, 267 complete and 0 interrupted iterations
relay_latency   [  65% ] 20/20 VUs  2m35.8s/4m00.0s

running (2m37.0s), 20/20 VUs, 268 complete and 0 interrupted iterations
relay_latency   [  65% ] 20/20 VUs  2m36.8s/4m00.0s

running (2m38.0s), 19/20 VUs, 272 complete and 0 interrupted iterations
relay_latency   [  66% ] 19/20 VUs  2m37.8s/4m00.0s

running (2m39.0s), 19/20 VUs, 282 complete and 0 interrupted iterations
relay_latency   [  66% ] 19/20 VUs  2m38.8s/4m00.0s

running (2m40.0s), 19/20 VUs, 284 complete and 0 interrupted iterations
relay_latency   [  67% ] 19/20 VUs  2m39.8s/4m00.0s

running (2m41.0s), 19/20 VUs, 286 complete and 0 interrupted iterations
relay_latency   [  67% ] 19/20 VUs  2m40.8s/4m00.0s

running (2m42.0s), 19/20 VUs, 287 complete and 0 interrupted iterations
relay_latency   [  67% ] 19/20 VUs  2m41.8s/4m00.0s

running (2m43.0s), 19/20 VUs, 288 complete and 0 interrupted iterations
relay_latency   [  68% ] 19/20 VUs  2m42.8s/4m00.0s

running (2m44.0s), 19/20 VUs, 289 complete and 0 interrupted iterations
relay_latency   [  68% ] 19/20 VUs  2m43.8s/4m00.0s

running (2m45.0s), 18/20 VUs, 292 complete and 0 interrupted iterations
relay_latency   [  69% ] 18/20 VUs  2m44.8s/4m00.0s

running (2m46.0s), 18/20 VUs, 301 complete and 0 interrupted iterations
relay_latency   [  69% ] 18/20 VUs  2m45.8s/4m00.0s

running (2m47.0s), 18/20 VUs, 305 complete and 0 interrupted iterations
relay_latency   [  69% ] 18/20 VUs  2m46.8s/4m00.0s

running (2m48.0s), 18/20 VUs, 306 complete and 0 interrupted iterations
relay_latency   [  70% ] 18/20 VUs  2m47.8s/4m00.0s

running (2m49.0s), 18/20 VUs, 308 complete and 0 interrupted iterations
relay_latency   [  70% ] 18/20 VUs  2m48.8s/4m00.0s

running (2m50.0s), 18/20 VUs, 309 complete and 0 interrupted iterations
relay_latency   [  71% ] 18/20 VUs  2m49.8s/4m00.0s

running (2m51.0s), 18/20 VUs, 313 complete and 0 interrupted iterations
relay_latency   [  71% ] 18/20 VUs  2m50.8s/4m00.0s

running (2m52.0s), 17/20 VUs, 319 complete and 0 interrupted iterations
relay_latency   [  72% ] 17/20 VUs  2m51.8s/4m00.0s

running (2m53.0s), 17/20 VUs, 324 complete and 0 interrupted iterations
relay_latency   [  72% ] 17/20 VUs  2m52.8s/4m00.0s

running (2m54.0s), 17/20 VUs, 326 complete and 0 interrupted iterations
relay_latency   [  72% ] 17/20 VUs  2m53.8s/4m00.0s

running (2m55.0s), 17/20 VUs, 326 complete and 0 interrupted iterations
relay_latency   [  73% ] 17/20 VUs  2m54.8s/4m00.0s

running (2m56.0s), 16/20 VUs, 330 complete and 0 interrupted iterations
relay_latency   [  73% ] 16/20 VUs  2m55.8s/4m00.0s

running (2m57.0s), 16/20 VUs, 334 complete and 0 interrupted iterations
relay_latency   [  74% ] 16/20 VUs  2m56.8s/4m00.0s

running (2m58.0s), 16/20 VUs, 336 complete and 0 interrupted iterations
relay_latency   [  74% ] 16/20 VUs  2m57.8s/4m00.0s

running (2m59.0s), 16/20 VUs, 343 complete and 0 interrupted iterations
relay_latency   [  74% ] 16/20 VUs  2m58.8s/4m00.0s

running (3m00.0s), 16/20 VUs, 343 complete and 0 interrupted iterations
relay_latency   [  75% ] 16/20 VUs  2m59.8s/4m00.0s

running (3m01.0s), 16/20 VUs, 345 complete and 0 interrupted iterations
relay_latency   [  75% ] 16/20 VUs  3m00.8s/4m00.0s

running (3m02.0s), 15/20 VUs, 349 complete and 0 interrupted iterations
relay_latency   [  76% ] 15/20 VUs  3m01.8s/4m00.0s

running (3m03.0s), 15/20 VUs, 352 complete and 0 interrupted iterations
relay_latency   [  76% ] 15/20 VUs  3m02.8s/4m00.0s

running (3m04.0s), 15/20 VUs, 354 complete and 0 interrupted iterations
relay_latency   [  77% ] 15/20 VUs  3m03.8s/4m00.0s

running (3m05.0s), 15/20 VUs, 359 complete and 0 interrupted iterations
relay_latency   [  77% ] 15/20 VUs  3m04.8s/4m00.0s

running (3m06.0s), 15/20 VUs, 361 complete and 0 interrupted iterations
relay_latency   [  77% ] 15/20 VUs  3m05.8s/4m00.0s

running (3m07.0s), 15/20 VUs, 364 complete and 0 interrupted iterations
relay_latency   [  78% ] 15/20 VUs  3m06.8s/4m00.0s

running (3m08.0s), 15/20 VUs, 367 complete and 0 interrupted iterations
relay_latency   [  78% ] 15/20 VUs  3m07.8s/4m00.0s

running (3m09.0s), 14/20 VUs, 369 complete and 0 interrupted iterations
relay_latency   [  79% ] 14/20 VUs  3m08.8s/4m00.0s

running (3m10.0s), 14/20 VUs, 374 complete and 0 interrupted iterations
relay_latency   [  79% ] 14/20 VUs  3m09.8s/4m00.0s

running (3m11.0s), 14/20 VUs, 376 complete and 0 interrupted iterations
relay_latency   [  79% ] 14/20 VUs  3m10.8s/4m00.0s

running (3m12.0s), 14/20 VUs, 379 complete and 0 interrupted iterations
relay_latency   [  80% ] 14/20 VUs  3m11.8s/4m00.0s

running (3m13.0s), 14/20 VUs, 381 complete and 0 interrupted iterations
relay_latency   [  80% ] 14/20 VUs  3m12.8s/4m00.0s

running (3m14.0s), 13/20 VUs, 382 complete and 0 interrupted iterations
relay_latency   [  81% ] 13/20 VUs  3m13.8s/4m00.0s

running (3m15.0s), 13/20 VUs, 384 complete and 0 interrupted iterations
relay_latency   [  81% ] 13/20 VUs  3m14.8s/4m00.0s

running (3m16.0s), 13/20 VUs, 390 complete and 0 interrupted iterations
relay_latency   [  82% ] 13/20 VUs  3m15.8s/4m00.0s

running (3m17.0s), 13/20 VUs, 392 complete and 0 interrupted iterations
relay_latency   [  82% ] 13/20 VUs  3m16.8s/4m00.0s

running (3m18.0s), 13/20 VUs, 395 complete and 0 interrupted iterations
relay_latency   [  82% ] 13/20 VUs  3m17.8s/4m00.0s

running (3m19.0s), 13/20 VUs, 395 complete and 0 interrupted iterations
relay_latency   [  83% ] 13/20 VUs  3m18.8s/4m00.0s

running (3m20.0s), 13/20 VUs, 397 complete and 0 interrupted iterations
relay_latency   [  83% ] 13/20 VUs  3m19.8s/4m00.0s

running (3m21.0s), 13/20 VUs, 400 complete and 0 interrupted iterations
relay_latency   [  84% ] 13/20 VUs  3m20.8s/4m00.0s

running (3m22.0s), 13/20 VUs, 405 complete and 0 interrupted iterations
relay_latency   [  84% ] 13/20 VUs  3m21.8s/4m00.0s

running (3m23.0s), 12/20 VUs, 408 complete and 0 interrupted iterations
relay_latency   [  84% ] 12/20 VUs  3m22.8s/4m00.0s

running (3m24.0s), 12/20 VUs, 408 complete and 0 interrupted iterations
relay_latency   [  85% ] 12/20 VUs  3m23.8s/4m00.0s

running (3m25.0s), 12/20 VUs, 409 complete and 0 interrupted iterations
relay_latency   [  85% ] 12/20 VUs  3m24.8s/4m00.0s

running (3m26.0s), 12/20 VUs, 412 complete and 0 interrupted iterations
relay_latency   [  86% ] 12/20 VUs  3m25.8s/4m00.0s

running (3m27.0s), 11/20 VUs, 418 complete and 0 interrupted iterations
relay_latency   [  86% ] 11/20 VUs  3m26.8s/4m00.0s

running (3m28.0s), 11/20 VUs, 420 complete and 0 interrupted iterations
relay_latency   [  87% ] 11/20 VUs  3m27.8s/4m00.0s

running (3m29.0s), 11/20 VUs, 420 complete and 0 interrupted iterations
relay_latency   [  87% ] 11/20 VUs  3m28.8s/4m00.0s

running (3m30.0s), 11/20 VUs, 421 complete and 0 interrupted iterations
relay_latency   [  87% ] 11/20 VUs  3m29.8s/4m00.0s

running (3m31.0s), 11/20 VUs, 424 complete and 0 interrupted iterations
relay_latency   [  88% ] 11/20 VUs  3m30.8s/4m00.0s

running (3m32.0s), 10/20 VUs, 425 complete and 0 interrupted iterations
relay_latency   [  88% ] 10/20 VUs  3m31.8s/4m00.0s

running (3m33.0s), 10/20 VUs, 430 complete and 0 interrupted iterations
relay_latency   [  89% ] 10/20 VUs  3m32.8s/4m00.0s

running (3m34.0s), 10/20 VUs, 431 complete and 0 interrupted iterations
relay_latency   [  89% ] 10/20 VUs  3m33.8s/4m00.0s

running (3m35.0s), 10/20 VUs, 432 complete and 0 interrupted iterations
relay_latency   [  89% ] 10/20 VUs  3m34.8s/4m00.0s

running (3m36.0s), 09/20 VUs, 435 complete and 0 interrupted iterations
relay_latency   [  90% ] 09/20 VUs  3m35.8s/4m00.0s

running (3m37.0s), 09/20 VUs, 435 complete and 0 interrupted iterations
relay_latency   [  90% ] 09/20 VUs  3m36.8s/4m00.0s

running (3m38.0s), 08/20 VUs, 437 complete and 0 interrupted iterations
relay_latency   [  91% ] 08/20 VUs  3m37.8s/4m00.0s

running (3m39.0s), 08/20 VUs, 442 complete and 0 interrupted iterations
relay_latency   [  91% ] 08/20 VUs  3m38.8s/4m00.0s

running (3m40.0s), 08/20 VUs, 442 complete and 0 interrupted iterations
relay_latency   [  92% ] 08/20 VUs  3m39.8s/4m00.0s

running (3m41.0s), 07/20 VUs, 444 complete and 0 interrupted iterations
relay_latency   [  92% ] 07/20 VUs  3m40.8s/4m00.0s

running (3m42.0s), 07/20 VUs, 444 complete and 0 interrupted iterations
relay_latency   [  92% ] 07/20 VUs  3m41.8s/4m00.0s

running (3m43.0s), 07/20 VUs, 445 complete and 0 interrupted iterations
relay_latency   [  93% ] 07/20 VUs  3m42.8s/4m00.0s

running (3m44.0s), 07/20 VUs, 450 complete and 0 interrupted iterations
relay_latency   [  93% ] 07/20 VUs  3m43.8s/4m00.0s

running (3m45.0s), 07/20 VUs, 450 complete and 0 interrupted iterations
relay_latency   [  94% ] 07/20 VUs  3m44.8s/4m00.0s

running (3m46.0s), 07/20 VUs, 451 complete and 0 interrupted iterations
relay_latency   [  94% ] 07/20 VUs  3m45.8s/4m00.0s

running (3m47.0s), 07/20 VUs, 451 complete and 0 interrupted iterations
relay_latency   [  94% ] 07/20 VUs  3m46.8s/4m00.0s

running (3m48.0s), 06/20 VUs, 453 complete and 0 interrupted iterations
relay_latency   [  95% ] 06/20 VUs  3m47.8s/4m00.0s

running (3m49.0s), 05/20 VUs, 457 complete and 0 interrupted iterations
relay_latency   [  95% ] 05/20 VUs  3m48.8s/4m00.0s

running (3m50.0s), 05/20 VUs, 457 complete and 0 interrupted iterations
relay_latency   [  96% ] 05/20 VUs  3m49.8s/4m00.0s

running (3m51.0s), 05/20 VUs, 458 complete and 0 interrupted iterations
relay_latency   [  96% ] 05/20 VUs  3m50.8s/4m00.0s

running (3m52.0s), 05/20 VUs, 458 complete and 0 interrupted iterations
relay_latency   [  97% ] 05/20 VUs  3m51.8s/4m00.0s

running (3m53.0s), 05/20 VUs, 459 complete and 0 interrupted iterations
relay_latency   [  97% ] 05/20 VUs  3m52.8s/4m00.0s

running (3m54.0s), 05/20 VUs, 462 complete and 0 interrupted iterations
relay_latency   [  97% ] 05/20 VUs  3m53.8s/4m00.0s

running (3m55.0s), 04/20 VUs, 463 complete and 0 interrupted iterations
relay_latency   [  98% ] 04/20 VUs  3m54.8s/4m00.0s

running (3m56.0s), 04/20 VUs, 463 complete and 0 interrupted iterations
relay_latency   [  98% ] 04/20 VUs  3m55.8s/4m00.0s

running (3m57.0s), 04/20 VUs, 463 complete and 0 interrupted iterations
relay_latency   [  99% ] 04/20 VUs  3m56.8s/4m00.0s

running (3m58.0s), 03/20 VUs, 465 complete and 0 interrupted iterations
relay_latency   [  99% ] 03/20 VUs  3m57.8s/4m00.0s

running (3m59.0s), 02/20 VUs, 467 complete and 0 interrupted iterations
relay_latency   [  99% ] 02/20 VUs  3m58.8s/4m00.0s

running (4m00.0s), 02/20 VUs, 467 complete and 0 interrupted iterations
relay_latency   [ 100% ] 02/20 VUs  3m59.8s/4m00.0s

running (4m01.0s), 02/20 VUs, 467 complete and 0 interrupted iterations
relay_latency ↓ [ 100% ] 02/20 VUs  4m0s

running (4m02.0s), 02/20 VUs, 467 complete and 0 interrupted iterations
relay_latency ↓ [ 100% ] 02/20 VUs  4m0s

running (4m03.0s), 01/20 VUs, 468 complete and 0 interrupted iterations
relay_latency ↓ [ 100% ] 02/20 VUs  4m0s


  █ THRESHOLDS 

    http_req_failed
    ✗ 'rate<0.15' rate=47.04%

    relay_total_ms
    ✓ 'p(95)<10000' p(95)=0s


  █ TOTAL RESULTS 

    CUSTOM
    relay_failure..................: 3752   15.421976/s
    relay_post_ms..................: avg=58.68ms min=36ms    med=46ms    max=1.26s p(90)=98ms     p(95)=104ms   
    relay_total_ms.................: avg=0s      min=0s      med=0s      max=0s    p(90)=0s       p(95)=0s      

    HTTP
    http_req_duration..............: avg=79.89ms min=34.97ms med=45.63ms max=2.29s p(90)=107.14ms p(95)=183.51ms
      { expected_response:true }...: avg=99.01ms min=35.44ms med=44.66ms max=2.29s p(90)=157.61ms p(95)=268.51ms
    http_req_failed................: 47.04% 3752 out of 7975
    http_reqs......................: 7975   32.779919/s

    EXECUTION
    iteration_duration.............: avg=5.37s   min=4.8s    med=5.08s   max=7.36s p(90)=6.39s    p(95)=6.82s   
    iterations.....................: 469    1.927747/s
    vus............................: 1      min=1            max=20
    vus_max........................: 20     min=20           max=20

    NETWORK
    data_received..................: 7.6 MB 31 kB/s
    data_sent......................: 3.3 MB 14 kB/s



running (4m03.3s), 00/20 VUs, 469 complete and 0 interrupted iterations
relay_latency ✓ [ 100% ] 00/20 VUs  4m0s
time="2026-06-11T00:55:56+02:00" level=error msg="thresholds on metrics 'http_req_failed' have been crossed"